{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend files for reference.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point that loads the React app into a root div.",
  "frontend/src/App.tsx": "Main React shell with header, tab navigation, theming, Pro mode provider, and routed screens.",
  "frontend/src/features/docs/ArchitecturePipelineScreen.tsx": "Documentation viewer with tabbed sections displaying architecture, pipeline, styling, and code excerpts.",
  "frontend/src/features/docs/docsContent.ts": "Exports HTML-formatted documentation strings for architecture, pipeline, styling, and code examples.",
  "frontend/src/features/editor/EditorScreen.tsx": "Wraps the editor layout with the global editor state provider.",
  "frontend/src/features/editor/export/exporters.ts": "Provides functions to export the editor canvas as PNG, JPG, SVG, or WebM animation using brand name–based filenames.",
  "frontend/src/features/editor/inspector/BackgroundControls.tsx": "UI controls for selecting the scene's background mode through a dropdown.",
  "frontend/src/features/editor/inspector/CameraEffectsControls.tsx": "Displays camera effects settings, currently limited to disabled placeholders for upcoming features.",
  "frontend/src/features/editor/inspector/EffectsControls.tsx": "Controls bloom, rim light, and particle effects, including intensity sliders and Pro‑gated options.",
  "frontend/src/features/editor/inspector/ExportPanel.tsx": "UI for exporting outputs in multiple formats and resolutions with Pro restrictions and toast feedback.",
  "frontend/src/features/editor/inspector/GeometryControls.tsx": "Sliders for adjusting text extrusion, bevel size, and bevel smoothness.",
  "frontend/src/features/editor/inspector/InspectorPanel.tsx": "The main inspector container organizing geometry, material, effects, and export tabs plus brand name input.",
  "frontend/src/features/editor/inspector/LightingControls.tsx": "Controls for light intensity, angle, and shadow settings with conditional sliders for shadow properties.",
  "frontend/src/features/editor/inspector/MaterialControls.tsx": "UI controls for selecting style, material preset, surface sliders, and uploading a custom texture.",
  "frontend/src/features/editor/inspector/TransformControls.tsx": "Rotation sliders for X/Y/Z axes with a reset button tied to editor state.",
  "frontend/src/features/editor/layout/EditorLayout.tsx": "Defines the main editor layout with resizable panels for presets, viewport, inspector, and a bottom timeline.",
  "frontend/src/features/editor/logo/materials.ts": "Generates a MeshStandardMaterial based on style, material preset, roughness, metalness, and optional texture.",
  "frontend/src/features/editor/logo/ThreeTextLogo.tsx": "Renders the 3D text logo with live material, rotation, and animation updates from editor state.",
  "frontend/src/features/editor/LogoViewport.tsx": "Three.js canvas rendering the 3D logo with camera, controls, lighting, background, particles, and post‑processing.",
  "frontend/src/features/editor/presets/PresetsPanel.tsx": "Displays clickable brand style presets that apply predefined editor state configurations.",
  "frontend/src/features/editor/scene/Background.tsx": "Sets the scene background and fog based on the selected background mode.",
  "frontend/src/features/editor/scene/LightingRig.tsx": "Configures ambient, directional, and optional rim lighting using angles and intensity from editor state.",
  "frontend/src/features/editor/scene/Particles.tsx": "Creates animated particle points whose count and movement depend on particle intensity settings.",
  "frontend/src/features/editor/scene/PostProcessing.tsx": "Sets up postprocessing with bloom using EffectComposer, updating passes when bloom settings change.",
  "frontend/src/features/editor/state/editorState.tsx": "Defines the editor state model, default values, and functions to update state, reset transforms, and apply brand presets.",
  "frontend/src/features/editor/texture/DragDropTextureTarget.tsx": "Adds a drag‑and‑drop area that reads dropped image files as data URLs and updates the editor's custom texture state.",
  "frontend/src/features/editor/timeline/TimelineStrip.tsx": "UI strip for animation controls including play/pause, reset, and a slider to adjust animation speed.",
  "frontend/src/features/pro/FreeVsProPanel.tsx": "Displays Free vs Pro plan cards, a demo toggle, and a comparison of feature availability.",
  "frontend/src/features/pro/ProModeContext.tsx": "Provides a React context for toggling Pro mode and exposing its state to consumers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, status tracking, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, dark mode styles, custom scrollbars, and global typography/theme rules.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with QueryClient and InternetIdentity providers, and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, and existing feature definitions for the build."
}