{
  "backend/main.mo": "Defines an actor exposing an async hello function that returns a greeting.",
  "feature_evidence.json": "Feature evidence report detailing features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing architecture, editor features, and rendering logic.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "Base HTML document that loads the root React app via main.tsx.",
  "frontend/src/App.tsx": "Main application shell with tabs and theming wrapped in StartupErrorBoundary and ProModeProvider.",
  "frontend/src/features/docs/ArchitecturePipelineScreen.tsx": "Documentation screen showing architecture, pipeline, styling, and code examples using tabbed UI.",
  "frontend/src/features/docs/docsContent.ts": "Static HTML content strings supplying architecture, pipeline, and styling documentation.",
  "frontend/src/features/editor/components/ViewportErrorBoundary.tsx": "Error boundary that catches viewport rendering failures and shows a fallback UI with reload and error details.",
  "frontend/src/features/editor/EditorScreen.tsx": "Wraps the editor layout in the EditorStateProvider.",
  "frontend/src/features/editor/export/exporters.ts": "Provides PNG, JPG, SVG, and WebM animation export utilities using canvas rendering and file downloads.",
  "frontend/src/features/editor/inspector/BackgroundControls.tsx": "UI controls for selecting the editor's background mode via a dropdown.",
  "frontend/src/features/editor/inspector/CameraEffectsControls.tsx": "Displays planned camera effect options like depth of field and motion blur, currently disabled and marked as coming soon.",
  "frontend/src/features/editor/inspector/EffectsControls.tsx": "Controls bloom, rim lighting, and particle effects with sliders and Pro‑only gating.",
  "frontend/src/features/editor/inspector/ExportPanel.tsx": "Export UI for PNG, JPG, SVG, and animation with resolution selection and Pro restrictions.",
  "frontend/src/features/editor/inspector/GeometryControls.tsx": "Adjusts geometry parameters including extrusion depth, bevel size, and bevel smoothness.",
  "frontend/src/features/editor/inspector/InspectorPanel.tsx": "Main inspector layout offering tabs for geometry, material, effects, and export settings plus brand name editing.",
  "frontend/src/features/editor/inspector/LightingControls.tsx": "UI panel providing sliders and switches to adjust lighting angles, intensity, and shadow settings in the editor state.",
  "frontend/src/features/editor/inspector/MaterialControls.tsx": "Material and style configuration panel with preset selectors, roughness/metalness sliders, and custom texture upload support.",
  "frontend/src/features/editor/inspector/TransformControls.tsx": "Rotation controls for X, Y, Z axes with a reset button updating the logo’s transform state.",
  "frontend/src/features/editor/layout/EditorLayout.tsx": "Defines the main editor layout with resizable panels for presets, viewport, inspector, and a bottom timeline strip.",
  "frontend/src/features/editor/logo/materials.ts": "Generates a THREE.MeshStandardMaterial using style presets, material presets, and optional custom textures.",
  "frontend/src/features/editor/logo/ThreeTextLogo.tsx": "Renders the 3D text logo with dynamic material, rotation, animation, and geometry settings based on editor state.",
  "frontend/src/features/editor/LogoViewport.tsx": "3D viewport component handling WebGL checks, context loss, scene setup, post-processing safety, and notifications.",
  "frontend/src/features/editor/presets/PresetsPanel.tsx": "Displays clickable brand style presets that apply predefined visual configurations to the editor state.",
  "frontend/src/features/editor/scene/Background.tsx": "Renders different background environments—transparent, studio, dark stage, or gradient—based on editor state.",
  "frontend/src/features/editor/scene/LightingRig.tsx": "Creates ambient, directional, and optional rim lighting with dynamic positioning driven by editor settings.",
  "frontend/src/features/editor/scene/Particles.tsx": "Generates animated particle effects with positions and velocities computed from particle intensity settings.",
  "frontend/src/features/editor/scene/PostProcessing.tsx": "Manages Three.js post‑processing with error handling, initializing and configuring an EffectComposer and bloom pass.",
  "frontend/src/features/editor/scene/SafePostProcessing.tsx": "Lazily loads PostProcessing and suppresses failures, rendering nothing if post‑processing is disabled or bloom is off.",
  "frontend/src/features/editor/state/editorState.tsx": "Defines the editor’s global state, defaults, and context provider with update helpers and post‑processing disable logic.",
  "frontend/src/features/editor/texture/DragDropTextureTarget.tsx": "Provides a drag‑and‑drop area that loads dropped image files as custom textures into editor state.",
  "frontend/src/features/editor/timeline/TimelineStrip.tsx": "UI strip for animation controls, allowing play/pause, transform reset, and speed adjustment.",
  "frontend/src/features/editor/webgl/isWebGLAvailable.ts": "Checks browser support for WebGL2 or WebGL1 and logs detection results.",
  "frontend/src/features/pro/FreeVsProPanel.tsx": "Renders free vs pro plan UI with a demo toggle, pricing cards, and feature comparison.",
  "frontend/src/features/pro/ProModeContext.tsx": "Simple context managing Pro mode state and toggle functionality.",
  "frontend/src/features/startup/getWebGLDiagnostics.ts": "Collects and formats WebGL capability and environment diagnostics for troubleshooting.",
  "frontend/src/features/startup/StartupErrorBoundary.tsx": "Error boundary that monitors early‑startup errors, filters non‑fatal ones, and captures error details.",
  "frontend/src/features/startup/StartupFallbackScreen.tsx": "Displays an error screen on startup failure with reload, cache-clear, and diagnostic detail options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and initializes AuthClient with custom behavior.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode, scrollbars, and global typography/layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, typography, and plugin setup.",
  "project_state.json": "Stores project metadata, architecture notes, known issues, and existing feature definitions."
}