{
  "kind": "build_request",
  "title": "Fix persistent startup initialization failure (StartupFallbackScreen shown)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Diagnose and fix the root cause of the startup failure that triggers the global StartupErrorBoundary so the app reliably loads to the main UI (Editor tab) in production builds instead of showing the message \"The app encountered a startup problem\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The app encountered a startup problem\nFix this"
        ]
      },
      "acceptanceCriteria": [
        "In a production build, opening the app shows the normal App UI (header + tabs + editor layout) and does not immediately render StartupFallbackScreen.",
        "No uncaught errors or unhandled promise rejections occur during initial mount that cause StartupErrorBoundary to enter the error state.",
        "If an error still occurs, the error is attributable to a clearly identified failing module and is handled or guarded so it does not crash the entire app unless truly unrecoverable."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Harden 3D viewport initialization so failures in WebGL renderer creation or post-processing setup cannot crash the entire application; instead, gracefully fall back to a working editor viewport without post-processing when possible, and only show StartupFallbackScreen when the app truly cannot start.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix this"
        ]
      },
      "acceptanceCriteria": [
        "If post-processing (EffectComposer/bloom) initialization or render fails, the session continues rendering the core 3D scene and clearly indicates that effects were disabled (without tripping StartupErrorBoundary).",
        "If WebGL is unavailable, the app renders the in-app WebGL-required message from the viewport area (not the global StartupFallbackScreen).",
        "The app does not get stuck in a broken state after a WebGL context loss; the viewport shows the context-lost message and instructs the user to reload."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure startup error diagnostics are actionable: when StartupFallbackScreen is shown, it must consistently include the captured error message/stack (when available) plus WebGL diagnostics, and the \"Copy details\" action must copy both sections as plain text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The app encountered a startup problem"
        ]
      },
      "acceptanceCriteria": [
        "When StartupFallbackScreen is rendered due to an Error, the \"Technical details\" section shows the error message and stack trace when provided by StartupErrorBoundary.",
        "The WebGL diagnostics block is populated (or clearly states WebGL is not available) and is included in the copied text.",
        "Clicking \"Copy details\" copies a single text blob that includes: error message, stack trace (if present), and the full WebGL diagnostics output."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components must be composed, not modified).",
    "Do not edit immutable hook/bootstrap files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new editor features (materials, effects, exports, presets) beyond what is necessary to resolve the startup failure.",
    "Changing backend canister logic or adding new backend APIs (unless proven necessary for the startup fix).",
    "Introducing third-party services or new authentication methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}