{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize startup by isolating viewport failures and improving diagnostics",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Fix the root cause(s) that trigger StartupErrorBoundary during initial mount so production builds reliably load the main Editor UI.",
      "acceptanceCriteria": [
        "In a production build, opening the app shows the normal App UI (header + tabs + editor layout) and does not immediately render StartupFallbackScreen.",
        "No uncaught errors or unhandled promise rejections occur during initial mount that cause StartupErrorBoundary to enter the error state.",
        "If an error still occurs, the error is attributable to a clearly identified failing module and is handled or guarded so it does not crash the entire app unless truly unrecoverable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/startup/StartupErrorBoundary.tsx",
          "operation": "modify",
          "description": "Harden startup boundary behavior: (1) scope global window error/unhandledrejection listeners to a bounded startup window and remove them after initialization, (2) ignore well-known non-fatal browser errors (e.g., ResizeObserver loop) so they do not flip the app into the startup-failure state, (3) avoid repeatedly setting error state once already failed, and (4) capture component stack (from componentDidCatch) in boundary state for actionable diagnostics."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust StartupErrorBoundary fallback wiring to pass through enhanced diagnostics (error + component stack / metadata) so the fallback screen can render actionable details while keeping the normal App shell unchanged on successful startups."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Prevent 3D viewport initialization failures (renderer, context, or post-processing) from crashing the entire app; gracefully degrade to a working viewport and show WebGL-required messaging only inside the viewport area.",
      "acceptanceCriteria": [
        "If post-processing (EffectComposer/bloom) initialization or render fails, the session continues rendering the core 3D scene and clearly indicates that effects were disabled (without tripping StartupErrorBoundary).",
        "If WebGL is unavailable, the app renders the in-app WebGL-required message from the viewport area (not the global StartupFallbackScreen).",
        "The app does not get stuck in a broken state after a WebGL context loss; the viewport shows the context-lost message and instructs the user to reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/editor/LogoViewport.tsx",
          "operation": "modify",
          "description": "Isolate viewport failures from global startup: wrap the Canvas/scene subtree in a viewport-local error boundary so renderer creation/runtime errors render a viewport-scoped fallback UI (not StartupFallbackScreen). Ensure viewport fallback keeps the rest of the editor UI alive and continues to show the existing WebGL-unavailable and context-lost messages in the viewport region."
        },
        {
          "path": "frontend/src/features/editor/scene/PostProcessing.tsx",
          "operation": "modify",
          "description": "Further harden post-processing to never throw: expand guards around initialization/configuration/render to ensure any unexpected errors only call disablePostProcessing and never bubble up. Ensure the component behaves safely across size changes and unmount/remount cycles."
        },
        {
          "path": "frontend/src/features/editor/scene/SafePostProcessing.tsx",
          "operation": "create",
          "description": "Create a safe wrapper that loads/uses PostProcessing defensively (e.g., lazy-load + local error boundary) and, on failure, disables effects via editor state while allowing the core 3D scene to keep rendering. This wrapper will be used by LogoViewport to prevent module/init issues from propagating to StartupErrorBoundary."
        },
        {
          "path": "frontend/src/features/editor/components/ViewportErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a dedicated, viewport-scoped React error boundary that catches errors from Canvas/Three/post-processing and renders a clear in-viewport fallback (with English guidance to reload) without affecting the global app startup boundary."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Make StartupFallbackScreen diagnostics consistently actionable: always show error message/stack when available plus WebGL diagnostics, and ensure Copy details copies both as plain text.",
      "acceptanceCriteria": [
        "When StartupFallbackScreen is rendered due to an Error, the \"Technical details\" section shows the error message and stack trace when provided by StartupErrorBoundary.",
        "The WebGL diagnostics block is populated (or clearly states WebGL is not available) and is included in the copied text.",
        "Clicking \"Copy details\" copies a single text blob that includes: error message, stack trace (if present), and the full WebGL diagnostics output."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/startup/StartupFallbackScreen.tsx",
          "operation": "modify",
          "description": "Ensure the fallback UI reliably renders: (1) display captured error message and stack consistently (including any component stack/extra details provided by StartupErrorBoundary), (2) always render a WebGL diagnostics section that either contains output or explicitly states WebGL diagnostics are unavailable/not supported, and (3) update the \"Copy details\" action to copy a single plain-text blob containing both the error section and the full WebGL diagnostics section."
        },
        {
          "path": "frontend/src/features/startup/getWebGLDiagnostics.ts",
          "operation": "modify",
          "description": "Harden WebGL diagnostics collection so it never throws and always returns a meaningful, clearly formatted output (including an explicit 'WebGL not available' / 'diagnostics failed' message) for display and copy-to-clipboard on StartupFallbackScreen."
        },
        {
          "path": "frontend/src/features/startup/StartupErrorBoundary.tsx",
          "operation": "modify",
          "description": "Extend the diagnostics captured during startup errors to include component stack (when available) and ensure the fallback receives it consistently so StartupFallbackScreen can display and copy it alongside error message/stack and WebGL diagnostics."
        }
      ]
    }
  ]
}